conf/src/InformationRegisters/ЭП_СостоянияОтправкиПочтовыхПием/ЭП_СостоянияОтправкиПочтовыхПием.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭП_СостоянияОтправкиПочтовыхПием</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ТекстПисьма</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Почта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРегситратор</name>
    <type>
      <types>DocumentRef.ЭП_ПланированиеТрудозатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтсутсвуютДругиеПользователиВРассылке</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Отправлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/Documents/ЭП_ПланированиеТрудозатрат/ЭП_ПланированиеТрудозатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭП_ПланированиеТрудозатрат</name>
  <comment> Спиридонов А.И. 09.12.2024</comment>
  <posting>Deny</posting>
  <registerRecords>AccumulationRegister.ЭП_СогласованныеЧасыПереработок</registerRecords>
  <registerRecords>AccumulationRegister.ЭП_УчетОтгулов</registerRecords>
  <registerRecords>AccumulationRegister.ЭП_ЧасыПереработокНаСогласование</registerRecords>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.ЭП_СтатусыДокументаУтверждениеПереработок</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Департамент</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРасчетногоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияРасчетногоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СогласованиеПланаОтветственными</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласованиеФактаОтветственными</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласованиеОтветственными</name>
    <type>
      <types>EnumRef.ЭП_СогласованиеПланаФакта</types>
    </type>
  </attributes>
  <attributes>
    <name>ОповещениеСообщений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОтсветсвенных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ЭП_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.РазделыПроекта</types>
      </type>
    </attributes>
    <attributes>
      <name>ТехническийПроект</name>
      <type>
        <types>CatalogRef.ТехническиеПроекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Задача</name>
      <type>
        <types>CatalogRef.ЗадачиПроцесса</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыПоТабелю</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Департамент</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Отгул</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыПереработок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПротоколВзаимодействия</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстПоручения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсполнительУтвержденияПереработок</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.ЭП_СтатусыДокументаУтверждениеПереработок</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

conf/src/CommonModules/ЭП_ОтправкаПочтовыхСообщений/Module.bsl
#Область ПрограмныйИнтерфейс

Процедура ОтправитьСообщениеПоПочте() Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭП_СостоянияОтправкиПочтовыхПием.Период КАК Период,
	|	ЭП_СостоянияОтправкиПочтовыхПием.Пользователь КАК Пользователь,
	|	ЭП_СостоянияОтправкиПочтовыхПием.Почта КАК Почта,
	|	ЭП_СостоянияОтправкиПочтовыхПием.ОтсутсвуютДругиеПользователиВРассылке КАК ОтсутсвуютДругиеПользователиВРассылке,
	|	ЭП_СостоянияОтправкиПочтовыхПием.ТекстПисьма КАК ТекстПисьма,
	|	ЭП_СостоянияОтправкиПочтовыхПием.ДокументРегситратор КАК ДокументРегситратор,
	|	ЭП_СостоянияОтправкиПочтовыхПием.ДокументРегситратор.Проект.Представление КАК ПроектПредставление,
	|	ЭП_СостоянияОтправкиПочтовыхПием.Отправлен КАК Отправлен
	|ИЗ
	|	РегистрСведений.ЭП_СостоянияОтправкиПочтовыхПием КАК ЭП_СостоянияОтправкиПочтовыхПием
	|ГДЕ
	|	НЕ ЭП_СостоянияОтправкиПочтовыхПием.Отправлен";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		СистемнаяУчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			// А вот 8.3.25 есть свой метод вызвать паузу	
			ВызватьПаузу(Константы.ЭП_ЗадержкаПередотправкойПисем.Получить());

			Если Не Выборка.ОтсутсвуютДругиеПользователиВРассылке И Не Выборка.Отправлен Тогда 
							
				Попытка
					
					ТекстПисьма = Выборка.ТекстПисьма.Получить();
					
					Если ТекстПисьма = Неопределено Тогда 
						
						ТабЧастьСотрудники = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.ДокументРегситратор,"Сотрудники").Выгрузить();
						ПроектДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.ДокументРегситратор,"Проект"); 
						
						ТекстПисьма = ЭП_ПочтовыеФункции.СоздатьТекстПисьма(Выборка.Пользователь, Выборка.Пользователь.Департамент, 
						ТабЧастьСотрудники, ПроектДокумента, Выборка.ДокументРегситратор);
						
					КонецЕсли;
					
				Исключение
					
					Описание = ОписаниеОшибки();									
					Информация = ИнформацияОбОшибке();					
					Подробности = ПодробноеПредставлениеОшибки(Информация);
					ЗаписьЖурналаРегистрации("Отправка писем через фоновое задание по одному пользователю", УровеньЖурналаРегистрации.Ошибка, , , 
					"Не удалось отправить письмо по сотруднику " + Выборка.Пользователь + ": " + Подробности);
					
				КонецПопытки;

						
				Попытка				
					
					ОтправитьПочтовоеСообщение(Выборка.Почта,ТекстПисьма, 
					СистемнаяУчетнаяЗапись, Выборка.ПроектПредставление); 
					
					ОбновитьЗаписьВРегистре(Выборка.Период, Выборка.Пользователь, Выборка.Почта,
					Выборка.ДокументРегситратор, Выборка.ОтсутсвуютДругиеПользователиВРассылке);
											
				Исключение
					
					Описание = ОписаниеОшибки();									
					Информация = ИнформацияОбОшибке();					
					Подробности = ПодробноеПредставлениеОшибки(Информация);
					ЗаписьЖурналаРегистрации("Отправка писем через фоновое задание по одному пользователю", УровеньЖурналаРегистрации.Ошибка, , , 
					"Не удалось отправить письмо по сотруднику " + Выборка.Пользователь + ": " + Подробности);
					
				КонецПопытки;
				
			ИначеЕсли Выборка.ОтсутсвуютДругиеПользователиВРассылке И Не Выборка.Отправлен Тогда
				
				ДокументРегистратор = Выборка.ДокументРегситратор;
				Период = Выборка.Период;
				Почта = Выборка.Почта;
				ОтсутсвуютДругиеПользователиВРассылке = Выборка.ОтсутсвуютДругиеПользователиВРассылке;
				Пользователь = Выборка.Пользователь;
				ПредставлениеПроекта = Выборка.ПроектПредставление; 
				ТабЧастьСотрудники = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументРегистратор,"Сотрудники").Выгрузить();
				ПроектДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументРегистратор,"Проект");
				
				МассивДанныхПользователей = ЭП_ПочтовыеФункции.ПолучитьМассивОтветственных(ПроектДокумента);
								
				ЗаписьВыполненаУспешно = Ложь;
								
				Для Каждого СтрокаДанных Из МассивДанныхПользователей Цикл
					
					Попытка
						
						ПисьмоТекст = ЭП_ПочтовыеФункции.СоздатьТекстПисьма(СтрокаДанных.Ответственный, 
						СтрокаДанных.Департамент, ТабЧастьСотрудники, ПроектДокумента, ДокументРегистратор);
						
						ОтправитьПочтовоеСообщение(СтрокаДанных.АдресЭП, ПисьмоТекст, СистемнаяУчетнаяЗапись, ПредставлениеПроекта)
						 
					Исключение
						
						Описание = ОписаниеОшибки();					
						Информация = ИнформацияОбОшибке();						
						Подробности = ПодробноеПредставлениеОшибки(Информация);
						ЗаписьЖурналаРегистрации("Отправка писем через фоновое залание по всем пользователям", УровеньЖурналаРегистрации.Ошибка, , , 
						"Не удалось отправить письмо по сотрудникам: " + Подробности); 
						// Делаем записи уже по пользователю с проблемами, а запись в регистре удаляем, и теперь сообщения должны пытаться отправиться
						// только одному пользователю 
						АдресЭПДляЗаписи = ?(ЗначениеЗаполнено(СтрокаДанных.АдресЭП),СтрокаДанных.АдресЭП, "");
						ДокументРегистраторДляЗаписи = ?(ЗначениеЗаполнено(ДокументРегистратор), 
						ДокументРегистратор, Документы.ЭП_ПланированиеТрудозатрат.ПустаяСсылка()); 
						
						Если ЗначениеЗаполнено(СтрокаДанных.Ответственный)  Тогда
							
							МенеджерЗаписи = РегистрыСведений.ЭП_СостоянияОтправкиПочтовыхПием.СоздатьМенеджерЗаписи();
							МенеджерЗаписи.ТекстПисьма = Новый ХранилищеЗначения(ПисьмоТекст, Новый СжатиеДанных()); 
							МенеджерЗаписи.Почта = АдресЭПДляЗаписи;
							МенеджерЗаписи.ОтсутсвуютДругиеПользователиВРассылке = Ложь;
							МенеджерЗаписи.ДокументРегситратор = ДокументРегистраторДляЗаписи;
							МенеджерЗаписи.Пользователь = СтрокаДанных.Ответственный;
							МенеджерЗаписи.Период = ТекущаяДатаСеанса();
							МенеджерЗаписи.Отправлен = Ложь; 
							МенеджерЗаписи.Прочитать();
							Если Не МенеджерЗаписи.Выбран() Тогда
								МенеджерЗаписи.ТекстПисьма = Новый ХранилищеЗначения(ПисьмоТекст, Новый СжатиеДанных()); 
								МенеджерЗаписи.Почта = АдресЭПДляЗаписи;
								МенеджерЗаписи.ОтсутсвуютДругиеПользователиВРассылке = Ложь;
								МенеджерЗаписи.ДокументРегситратор = ДокументРегистраторДляЗаписи;
								МенеджерЗаписи.Пользователь = СтрокаДанных.Ответственный;
								МенеджерЗаписи.Период = ТекущаяДатаСеанса();
								МенеджерЗаписи.Отправлен = Ложь; 
								МенеджерЗаписи.Записать();
							КонецЕсли;
														
						КонецЕсли;
						
					КонецПопытки;
					
					ЗаписьВыполненаУспешно = Истина;
					
				КонецЦикла;
				
				Если ЗаписьВыполненаУспешно Тогда                                      
					ОбновитьЗаписьВРегистре(Период, Пользователь, Почта, ДокументРегистратор, ОтсутсвуютДругиеПользователиВРассылке) 			
				КонецЕсли;
				
			КонецЕсли;                                                                                  
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОтправитьПочтовоеСообщение(Почта, ТекстПисьма, СистемнаяУчетнаяЗапись, Проект)
	
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Кому", Почта);
	ПараметрыПисьма.Вставить("Тема", "Планирование переработок по проекту " + Проект);
	ПараметрыПисьма.Вставить("Тело", ТекстПисьма);
	ПараметрыПисьма.Вставить("ТипТекста", "HTML"); 		
	Письмо = РаботаСПочтовымиСообщениями.ПодготовитьПисьмо(СистемнаяУчетнаяЗапись, ПараметрыПисьма); 			
	РаботаСПочтовымиСообщениями.ОтправитьПисьмо(СистемнаяУчетнаяЗапись, Письмо);
			
КонецПроцедуры

Процедура УдалитьЗаписьВРегистреСведений(Период, Пользователь, Почта, ДокументРегситратор, ОтсутсвуютДругиеПользователиВРассылке) 
	
	Запись = РегистрыСведений.ЭП_СостоянияОтправкиПочтовыхПием.СоздатьМенеджерЗаписи(); 
	Запись.Период = Период;
	Запись.Пользователь = Пользователь;
	Запись.Почта = Почта;
	Запись.ДокументРегситратор = ДокументРегситратор;
	Запись.ОтсутсвуютДругиеПользователиВРассылке = ОтсутсвуютДругиеПользователиВРассылке;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Запись.Удалить();
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьВозможностьУдаленияЗаписиВРегистреСведений(Период, Пользователь, Почта, ДокументРегситратор, ОтсутсвуютДругиеПользователиВРассылке)
	
	Запись = РегистрыСведений.ЭП_СостоянияОтправкиПочтовыхПием.СоздатьМенеджерЗаписи(); 
	Запись.Период = Период;
	Запись.Пользователь = Пользователь;
	Запись.Почта = Почта;
	Запись.ДокументРегситратор = ДокументРегситратор;
	Запись.ОтсутсвуютДругиеПользователиВРассылке = ОтсутсвуютДругиеПользователиВРассылке;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Возврат Истина; 
	Иначе
		Возврат Ложь;	
	КонецЕсли;	
	
КонецФункции

Процедура ВызватьПаузу(Секунды)
	
    ВремяОкончания = ТекущаяДата() + Секунды;
    Пока ТекущаяДата() <= ВремяОкончания Цикл
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьЗаписьВРегистре(Период, Пользователь, Почта, ДокументРегситратор, ОтсутсвуютДругиеПользователиВРассылке)
	
	Запись = РегистрыСведений.ЭП_СостоянияОтправкиПочтовыхПием.СоздатьМенеджерЗаписи(); 
	Запись.Период = Период;
	Запись.Пользователь = Пользователь;
	Запись.Почта = Почта;
	Запись.ДокументРегситратор = ДокументРегситратор;
	Запись.ОтсутсвуютДругиеПользователиВРассылке = ОтсутсвуютДругиеПользователиВРассылке;
	Запись.Отправлен = Ложь;	
	Запись.Прочитать();
	Если Запись.Выбран() Тогда 
		Запись.Отправлен = Истина;
		Запись.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
